# https://github.com/Homebrew/homebrew-bundle

# To Export the apps installed on the current system:
# cd ~/.dotfiles/hidden
# rm Brewfile
# brew bundle dump

cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
# tap "homebrew/cask-versions"
# tap "homebrew/core"
# tap "homebrew/services"
# tap "theory/sqitch"

brew "ack"
brew "fzf"
brew "git"
brew "go"
brew "httpie"
brew "jq"
# brew "karabiner-elements"
brew "neovim"
brew "nvm"
brew "openssl"
brew "ripgrep"
brew "tree"
brew "vim"
brew "wget"

cask "1password"
cask "alfred"
cask "atom"
cask "docker"
cask "harvest"
cask "keybase"
cask "kitematic"
cask "ngrok"
cask "numi"
cask "tableplus"
cask "visual-studio-code"

mas "Affinity Designer", id: 824171161
mas "ColorDial", id: 1064152481
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "WiFi Explorer", id: 494803304
mas "Xcode", id: 497799835
mas "Wipr", id: 1320666476

# brew "awscli"
# brew "azure-cli"
# brew "ffmpeg"
# brew "keka"
# brew "hub"
# brew "fontforge"
# brew "openvpn", restart_service: true, link: false
# brew "pyenv"
# brew "terraform"
# brew "tmux"

# cask "azure-data-studio"
# cask "datagrip"
# cask "dbeaver-community"
# cask "deckset"
# cask "google-chrome"
# cask "firefox"
# cask "intellij-idea"
# cask "java"
# cask "microsoft-azure-storage-explorer"
# cask "mongo-management-studio"
# case "netnewswire"
# cask "ngrok"
# cask "postico"
# cask "postman"
# cask "powershell"
# cask "robomongo"
# screenflow 7.3.1: https://github.com/Homebrew/homebrew-cask/pull/48803
# cask "screenflow@7.3.1"
# cask "sequel-pro"
# cask "slack"
# cask "viscosity" # VPN client
# cask "visual-studio"

# mas "Cyberduck", id: 409222199
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
# mas "Microsoft Remote Desktop", id: 715768417
# mas "TogglDesktop", id: 957734279
