# https://github.com/Homebrew/homebrew-bundle
cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'ack'
brew 'fzf'
brew 'git'
brew 'go'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'neovim'
brew 'nvm'
brew 'openssl'
brew 'pyenv'
brew 'ripgrep'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'


cask 'alfred'
cask 'google-chrome'
cask 'keybase'
cask 'visual-studio-code'

# cask '1password'
# cask 'dbeaver-community'
# cask 'firefox'
# cask 'mongo-management-studio'
# cask 'ngrok'
# cask 'postico'
# cask 'powershell'
# cask 'robomongo'
# cask 'sequel-pro'
# cask 'slack'
# cask 'tableplus'

